In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'date': ['2015-05-08', '2015-05-07', '2015-05-06', '2015-05-05',
             '2015-05-08', '2015-05-07', '2015-05-06', '2015-05-05'],
    'sym': ['aapl', 'aapl', 'aapl', 'aapl', 'aaww', 'aaww', 'aaww', 'aaww'],
    'data2': [11, 8, 10, 15, 110, 60, 100, 40],
    'data3': [5, 8, 6, 1, 50, 100, 60, 120]
})

In [3]:
df

         date   sym  data2  data3
0  2015-05-08  aapl     11      5
1  2015-05-07  aapl      8      8
2  2015-05-06  aapl     10      6
3  2015-05-05  aapl     15      1
4  2015-05-08  aaww    110     50
5  2015-05-07  aaww     60    100
6  2015-05-06  aaww    100     60
7  2015-05-05  aaww     40    120

In [5]:
df['data3'].groupby(df['date']).agg('sum')

date
2015-05-05    121
2015-05-06     66
2015-05-07    108
2015-05-08     55
Name: data3, dtype: int64

In [11]:
df['data4'] = df['data3'].groupby(df['date']).transform('sum')

In [12]:
df

         date   sym  data2  data3  data4
0  2015-05-08  aapl     11      5     55
1  2015-05-07  aapl      8      8    108
2  2015-05-06  aapl     10      6     66
3  2015-05-05  aapl     15      1    121
4  2015-05-08  aaww    110     50     55
5  2015-05-07  aaww     60    100    108
6  2015-05-06  aaww    100     60     66
7  2015-05-05  aaww     40    120    121